Revit 2026 API

# SweepProfileSketch Property

---

The profile sketch of the sweep.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Sketch ProfileSketch { get; }
```
```vb
Public ReadOnly Property ProfileSketch As Sketch
	Get
```
```cpp
public:
property Sketch^ ProfileSketch {
	Sketch^ get ();
}
```
```fsharp
member ProfileSketch : Sketch with get
```

#### Property Value

Sketch

If the profile is not based on sketched curves, this property is .

#### Reference

Sweep Class

Autodesk.Revit.DB Namespace